Autodesk.Revit.DB.STLImportOptions.#ctor(Autodesk.Revit.DB.STLImportOptions)
Constructs a new instance of STLImportOptions as a copy of the import options.
option:
The STL options to be copied.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022.1

Autodesk.Revit.DB.STLImportOptions.#ctor
Constructs a new instance of STLImportOptions with default values of all properties.
Since:
2022.1

Autodesk.Revit.DB.STLImportOptions
The import options used to import STL format files.
Since:
2022.1